tap 'homebrew/core'
tap 'homebrew/bundle'

# Install GNU core utilities (those that come with macOS are outdated).
brew 'coreutils'
# Don’t forget to add $(brew --prefix coreutils)/libexec/gnubin to $PATH.

# Install some other useful utilities like `sponge`.
brew 'moreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'

# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed', args: ['with-default-names']

# Install latest Bash and Bash completions.
# Note: don’t forget to add `/usr/local/bin/bash` to `/etc/shells` before
# running `chsh`.
brew 'bash'
brew 'bash-completion@2'

# Install `wget` with IRI support.
brew 'wget', args: ['with-iri']

# Install more recent versions of some macOS tools.
brew 'vim', args: ['with-override-system-vi']
brew 'grep'
brew 'openssh'
brew 'screen'

# Install CLI magic.
brew 'z'
brew 'thefuck'

# Install Git tools.
brew 'git'
brew 'git-extras'
brew 'git-flow'
brew 'diff-so-fancy'

# Install Node tools.
brew 'node'
brew 'yarn'

# Install everything else.
brew 'the_silver_searcher'
brew 'httpie'
brew 'lynx'
brew 'rename'
brew 'ruby'
brew 'tree'
